/*
 * @Author: Tina Huang
 * @Date: 2023-12-01 15:45:27
 * @LastEditors: Tina Huang
 * @LastEditTime: 2025-11-29 10:05:10
 * @Description: 
 */

const year = '2025'
const holidays = [{
  name: "元旦",
  day: 1,
  start: '2025/01/01 00:00:00',
  end: '2025/01/01 23:59:59',
},
{
  name: "春节",
  day: 8,
  start: '2025/01/28 00:00:00',
  end: '2025/02/04 23:59:59',
},
{
  name: "清明节",
  day: 3,
  start: '2025/04/04 00:00:00',
  end: '2025/04/06 23:59:59',
},
{
  name: "劳动节",
  day: 5,
  start: '2025/05/01 00:00:00',
  end: '2025/05/05 23:59:59',
},
{
  name: "端午节",
  day: 3,
  start: '2025/05/31 00:00:00',
  end: '2025/06/02 23:59:59',
},
{
  name: "中秋节+国庆节",
  day: 8,
  start: '2025/10/01 00:00:00',
  end: '2025/10/08 23:59:59',
}
]